<template>
      <div>  
          <div class="main">
                <h2>新闻资讯</h2>
               <ul>
                   <li v-for="(value,index) in num">
                        <div class="fl">
                        <router-link class="block" :to="{name:'game1',params:{date:value.date,title:value.title,author:value.author,content:value.content}}">
                               {{value.title}}
                        </router-link>
                        </div>
                        <div class="fr">
                            <strong class="fr block">{{value.date}} </strong>
                            <span class="fr block">{{value.author}}</span>
                        </div>
                   </li>
                </ul>
            </div> 
     </div>
</template>
<script>
export default{
//暴露一下
     data:function(){
            return{
                num:[
                {
                    title:"如何优雅地使用Sublime Text3",
                    author:"奥特曼",
                    content:`
								<p>Sublime Text：一款具有代码高亮、语法提示、自动完成且反应快速的编辑器软件，不仅具有华丽的界面，还支持插件扩展机制，用她来写代码，绝对是一种享受。相比于难于上手的Vim，浮肿沉重的Eclipse，VS，即便体积轻巧迅速启动的Editplus、Notepad++，在SublimeText面前大略显失色，无疑这款性感无比的编辑器是Coding和Writing最佳的选择，没有之一。</p>
								<p><strong>温情提醒</strong>：可以移步原文首链处：<strong>如何优雅地使用Sublime Text</strong>(因为那儿还在持续更新完善中)；Here最后更新于2015.12.15晚 (不能为简书文章添加目录？，额，折腾不出来，醉了)，但目录结构还是可以有的：</p>
								<p><strong>如何优雅地使用Sublime Text 之 目录结构</strong></p>

									<p>ST3支持在项目目录里面寻找变量</p>
									<p>提供了对标签页更好地支持（更多的命令和快捷键）</p>
									<p>加快了程序运行的速度</p>
									<p>更新了API，使用Python3.3</p>
								<p>强烈推荐朋友们使用3! 唯快不破，不解释。</p>`,
                    date:"2017-10-08"
                },
            {
                title:"秦皇岛盛邦升华简介",
                        author:"红太狼",
                    content:`
						<p>盛邦升华成立于2004年，是一家多年从事IT技术咨询和培训的企业，是河北省工业和信息化厅认定的民营企业经济人才培训基地，河北省人力资源和社会保障厅、河北省教育厅及河北省商务厅认定的秦皇岛市服务外包机构，人力资源和社会保障部下设的、中国大学生就业促进工程项目办公室认定的、中国大学生就业促进工程项目实训基地。</p>
						<p>盛邦升华现有教职员工210多人，教学培训教员均在一线企业任职3年以上，具有丰富的实战工作经验，由北京网易，奥美，电通，火星时代等知名企业的web前端总监，ui设计总监担任部分课程讲授与课程指导。</p>
						<p>盛邦升华萃取了十余年的办学经验，形成了一整套完备的、科学的、具有可操作性和可复制性的职业技能和职业素质培训体系及办学模式。弥补了国内职业教育机构普遍存在的“重入口轻出口、重学历轻能力、重理论轻实践、重技术轻素质”的问题，摸索出了一条出口拉动入口、实践与学习相理论、学历与能力并重、技能与素质同步提升”的成功的职业培训的新路子。</p>
						<p>盛邦升华对人的成长和教育规律进行了大量总结，针对不同阶段孩子的生活表现、社会表现、课堂表现、心理特征和身体特征进行了大量的分析归纳，制订了具有很强针对性、适应性和发展性的培养模式。通过分析总结中西方教育的差异，完善了具有自己特色的现代职业教育的二元制、现代学徒制、现代教练式训练的培养模式，提升了学员的专业水平、丰富了学员的实战技能、端正了学员的心态和增强了学员的职场能力。毕业的学员主要在北京、上海、杭州等地工作，有的已经自主创业、有的已经成为部门主管、还有的成为技术骨干，月收入基本在1万元以上。</p>
						`,
                    date:"2017-11-18"
            },
            {
                title:"秦皇岛盛邦升华简介(二)",
                        author:"猪猪侠",
                    content:`
						<p>盛邦升华成立于2004年，是一家多年从事IT技术咨询和培训的企业，是河北省工业和信息化厅认定的民营企业经济人才培训基地，河北省人力资源和社会保障厅、河北省教育厅及河北省商务厅认定的秦皇岛市服务外包机构，人力资源和社会保障部下设的、中国大学生就业促进工程项目办公室认定的、中国大学生就业促进工程项目实训基地。</p>
						<p>盛邦升华现有教职员工210多人，教学培训教员均在一线企业任职3年以上，具有丰富的实战工作经验，由北京网易，奥美，电通，火星时代等知名企业的web前端总监，ui设计总监担任部分课程讲授与课程指导。</p>
						<p>盛邦升华萃取了十余年的办学经验，形成了一整套完备的、科学的、具有可操作性和可复制性的职业技能和职业素质培训体系及办学模式。弥补了国内职业教育机构普遍存在的“重入口轻出口、重学历轻能力、重理论轻实践、重技术轻素质”的问题，摸索出了一条出口拉动入口、实践与学习相理论、学历与能力并重、技能与素质同步提升”的成功的职业培训的新路子。</p>
						<p>盛邦升华对人的成长和教育规律进行了大量总结，针对不同阶段孩子的生活表现、社会表现、课堂表现、心理特征和身体特征进行了大量的分析归纳，制订了具有很强针对性、适应性和发展性的培养模式。通过分析总结中西方教育的差异，完善了具有自己特色的现代职业教育的二元制、现代学徒制、现代教练式训练的培养模式，提升了学员的专业水平、丰富了学员的实战技能、端正了学员的心态和增强了学员的职场能力。毕业的学员主要在北京、上海、杭州等地工作，有的已经自主创业、有的已经成为部门主管、还有的成为技术骨干，月收入基本在1万元以上。</p>
						`,
                    date:"2017-08-28"
            },
            {
                title:"秦皇岛盛邦升华简介(三)",
                        author:"汪汪队",
                    content:`
						<p>盛邦升华成立于2004年，是一家多年从事IT技术咨询和培训的企业，是河北省工业和信息化厅认定的民营企业经济人才培训基地，河北省人力资源和社会保障厅、河北省教育厅及河北省商务厅认定的秦皇岛市服务外包机构，人力资源和社会保障部下设的、中国大学生就业促进工程项目办公室认定的、中国大学生就业促进工程项目实训基地。</p>
						<p>盛邦升华现有教职员工210多人，教学培训教员均在一线企业任职3年以上，具有丰富的实战工作经验，由北京网易，奥美，电通，火星时代等知名企业的web前端总监，ui设计总监担任部分课程讲授与课程指导。</p>
						<p>盛邦升华萃取了十余年的办学经验，形成了一整套完备的、科学的、具有可操作性和可复制性的职业技能和职业素质培训体系及办学模式。弥补了国内职业教育机构普遍存在的“重入口轻出口、重学历轻能力、重理论轻实践、重技术轻素质”的问题，摸索出了一条出口拉动入口、实践与学习相理论、学历与能力并重、技能与素质同步提升”的成功的职业培训的新路子。</p>
						<p>盛邦升华对人的成长和教育规律进行了大量总结，针对不同阶段孩子的生活表现、社会表现、课堂表现、心理特征和身体特征进行了大量的分析归纳，制订了具有很强针对性、适应性和发展性的培养模式。通过分析总结中西方教育的差异，完善了具有自己特色的现代职业教育的二元制、现代学徒制、现代教练式训练的培养模式，提升了学员的专业水平、丰富了学员的实战技能、端正了学员的心态和增强了学员的职场能力。毕业的学员主要在北京、上海、杭州等地工作，有的已经自主创业、有的已经成为部门主管、还有的成为技术骨干，月收入基本在1万元以上。</p>
						`,
                    date:"2017-09-28"
            },
            {
                title:"秦皇岛盛邦升华简介(四)",
                        author:"小猪佩奇",
                    content:`
						<p>盛邦升华成立于2004年，是一家多年从事IT技术咨询和培训的企业，是河北省工业和信息化厅认定的民营企业经济人才培训基地，河北省人力资源和社会保障厅、河北省教育厅及河北省商务厅认定的秦皇岛市服务外包机构，人力资源和社会保障部下设的、中国大学生就业促进工程项目办公室认定的、中国大学生就业促进工程项目实训基地。</p>
						<p>盛邦升华现有教职员工210多人，教学培训教员均在一线企业任职3年以上，具有丰富的实战工作经验，由北京网易，奥美，电通，火星时代等知名企业的web前端总监，ui设计总监担任部分课程讲授与课程指导。</p>
						<p>盛邦升华萃取了十余年的办学经验，形成了一整套完备的、科学的、具有可操作性和可复制性的职业技能和职业素质培训体系及办学模式。弥补了国内职业教育机构普遍存在的“重入口轻出口、重学历轻能力、重理论轻实践、重技术轻素质”的问题，摸索出了一条出口拉动入口、实践与学习相理论、学历与能力并重、技能与素质同步提升”的成功的职业培训的新路子。</p>
						<p>盛邦升华对人的成长和教育规律进行了大量总结，针对不同阶段孩子的生活表现、社会表现、课堂表现、心理特征和身体特征进行了大量的分析归纳，制订了具有很强针对性、适应性和发展性的培养模式。通过分析总结中西方教育的差异，完善了具有自己特色的现代职业教育的二元制、现代学徒制、现代教练式训练的培养模式，提升了学员的专业水平、丰富了学员的实战技能、端正了学员的心态和增强了学员的职场能力。毕业的学员主要在北京、上海、杭州等地工作，有的已经自主创业、有的已经成为部门主管、还有的成为技术骨干，月收入基本在1万元以上。</p>
						`,
                    date:"2017-08-28"
            }
            ]
            }
        }
}
</script>