 <template>
            <div class="main">
                <h1>点餐列表页面</h1>
                <ul>
                   <li v-for="(value,index) in num">
                        <div class="left">
                      <router-link class="block" :to="{name:'game1',params:{lis:value.lis,imge:value.bg_pic,mname:value.dname}}">
                                <img :src="value.sm_pic" alt="">
                        </router-link>
                        </div>
                        <div class="right">
                            <strong>
                             <router-link class="block" :to="{name:'game1',params:{lis:value.lis,imge:value.bg_pic,mname:value.dname}}">
                                {{value.dname}}
                              </router-link>
                            </strong>
                            <p>{{value.descrp}}</p>
                            <span>价格：{{value.price}}</span>
                        </div>
                   </li>
                   <router-link to="/main1" class="fanhui-m1">返回首页</router-link>
                </ul>
            </div>
</template>
<script>
export default{
 data:function(){
            return {
                num:[
                    {
                        sm_pic: 'src/assets/1_1.jpg',
                        bg_pic: 'src/assets/1.jpg',
                        dname: '【酸甜开胃虾】',
                        descrp: '明虾、番茄酱、白糖、白醋、葱、姜、淀粉',
                        price: 12,
                        lis: "这是酸甜开胃虾的详情..唐帝国天启十三年春，渭城下了一场雨。这座位于帝国广阔疆域西北端的军事边城，为了防范草原上野蛮人入侵，四向的土制城墙被垒得极为厚实，看上去就像是一个墩实的土围子。干燥时节土墙上的浮土被西北的风刀子一刮便会四处飘腾，然后落在简陋的营房上，落在兵卒们的身上，整个世界都将变成一片土黄色，人们夜里入睡抖铺盖时都会抖起一场沙尘暴。正在春旱，这场雨来的恰是时辰，受到军卒们的热烈欢迎，从昨夜至此时的淅淅沥沥雨点洗涮掉屋顶的灰尘，仿佛也把人们的眼睛也洗的明亮了很多。至少马士襄此时的眼睛很亮。"
                    },

                    {
                        sm_pic: 'src/assets/2_2.jpg',
                        bg_pic: 'src/assets/2.jpg',
                        dname: '【桂香紫薯山药卷】',
                        descrp: '切片吐司、紫薯、铁棍山药、糖桂花、炼乳',
                        price: 12,
                        lis: "这是桂香紫薯山药卷的详情..心的本色该是如此。成，如朗月照花，深潭微澜，不论顺逆，不论成败的超然，是扬鞭策马，登高临远的驿站；败，仍滴水穿石，汇流入海，有穷且益坚，不坠青云的傲岸，有“将相本无主，男儿当自强”的倔强。荣，江山依旧，风采犹然，恰沧海巫山，熟视岁月如流，浮华万千，不屑过眼烟云；辱，胯下韩信，雪底苍松，宛若羽化之仙，知退一步，海阔天空，不肯因噎废食。"
                    },

                    {
                        sm_pic: 'src/assets/3.jpg',
                        bg_pic: 'src/assets/3_3.jpg',
                        dname: '【蒸饺】',
                        descrp: '鸡蛋、豆角酱肉馅、西红柿鸡蛋馅、猪生抽、生抽、海鲜酱油、糖、盐',
                        price: 12,
                        lis: "这是蒸饺的详情..每一次都在徘徊、孤单中坚强，每一次就算受伤也不闪泪光。”今天我唱起了那首我从来不愿唱的隐形的《隐形的翅膀》。在以前，当别人唱起这首略带忧伤的歌时我总会搞破坏，专捡一些欢乐的歌曲来消减一下悲伤的气氛，因为我不想带着悲伤活在这个世界上。今天，我并不是想抱怨人生的坎坷，我只想从中学会坚强。     (结尾)坚强的意志，坚强的信念，坚强的„„一切的一切都在支撑着我们。"
                    },

                    {
                        sm_pic: 'src/assets/4.jpg',
                        bg_pic: 'src/assets/4_4.jpg',
                        dname: '【口袋饼】',
                        descrp: '面粉、黄瓜、香肠、热水、土豆、盐、醋、生抽、油。',
                        price: 12,
                        lis: "这是口袋饼的详情..即使青春是一枝娇艳的花，但我明白，一枝独放永远不是春天，春天该是万紫千红的世界。  即使青春是一株大地伟岸的树，但我明白，一株独秀永远不是挺拔，成行成排的林木，才是遮风挡沙的绿色长城。即使青春是一叶大海孤高的帆，但我明白，一叶孤帆很难远航，千帆竞发才是大海的壮观。"
                    },

                    {
                        sm_pic: 'src/assets/5_5.jpg',
                        bg_pic: 'src/assets/5.jpg',
                        dname: '【橄榄油版酸奶蛋糕】', descrp: '鸡蛋、玉米淀粉、绵白糖、白醋、低筋粉、橄榄油、酸奶。',
                        price: 12,
                        lis: "这是橄榄油版酸奶蛋糕的详情..让我怎样感谢你？ 当我走向你的时候，我原想收获一缕春风 ，你却给了我整个春天。      让我怎样感谢你 ？当我走向你的时候 我原想捧起一簇浪花，你却给了我整个海洋。      让我怎样感谢你 ？当我走向你的时候， 我原想撷取一枚红叶，你却给了我整个枫林。      让我怎样感谢你？当我走向你的时候， 我原想亲吻一朵雪花，你却给了我银色的世 界！"
                    },

                    {
                        sm_pic: 'src/assets/6.jpg',
                        bg_pic: 'src/assets/6_6.jpg',
                        dname: '【番茄肉酱意大利面】',
                        descrp: '这是开胃清蒸虾的描述...好吃好吃...',
                        price: 12,
                        lis: "这是番茄肉酱意大利面的详情...其实，感恩并不难，在父母眼中只要你理解他们，甚至只是当他们与你说话时你能着着他们而不是老盯着电视，当他们关心你时只要跟着答应而不是一味的顶撞，可我们连这点儿根本就算不上是感恩的要求都达不到，还何谈感恩。"
                    },

                    {
                        sm_pic: 'src/assets/7_7.jpg',
                        bg_pic: 'src/assets/7.jpg',
                        dname: '【小米椒爆炒小公鸡】',
                        descrp: '三黄鸡、杭椒、干红椒、新鲜小米椒、麻椒、八角、香叶、葱、姜、生抽',
                        price: 12,
                        lis: "这是小米椒爆炒小公鸡的详情..站在历史的海岸漫溯那一道道历史沟渠：楚大夫沉吟泽畔，九死不悔；魏武帝扬鞭东指，壮心不已；陶渊明悠然南山，饮酒采菊„„他们选择了永恒，纵然谄媚诬蔑视听，也不随其流扬其波，这是执著的选择；纵然马革裹尸，魂归狼烟，这是豪壮的选择；纵然一身清苦，终日难饱，也愿怡然自乐，躬耕陇亩，这是高雅的选择。在一番选择中，帝王将相成其盖世伟业，贤士迁客成其千古文章。"
                    }

                ]
            }
            }
            }
            </script>